Revit 2027 API
ParameterTypeId.RotateTruenorthAngle Property
 "Angle from Project to True North"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RotateTruenorthAngle { get; }
Public Shared ReadOnly Property RotateTruenorthAngle As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RotateTruenorthAngle {
	ForgeTypeId^ get ();
}
static member RotateTruenorthAngle : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace